app/Controllers/Users.php

    public function formtambah()
    {

        $data = [
            'datalevel' => $this->levels->findAll()
        ];
---
SELECT *
FROM `levels`

            } else {
                $modelLevel = new Modelusers();

                $modelLevel->insert([
                    'userid'         => $userid,
                    'usernama'       => $usernama,
                    'useremail'      => $useremail,
                    'userpassword'   => $userpassword,
                    'userlevelid'    => $userlevelid
                ]);
---
INSERT INTO `users` (`userid`, `usernama`, `useremail`, `userpassword`, `userlevelid`) VALUES ('sutino', 'Sutino', 'sutino1201@gmail.com', '123', '1')

    public function hapus($userid)
    {
        $this->users->delete($userid);
---
DELETE FROM `users`
WHERE `userid` IN ('sutino')